In [1]:
import pandas as pd

In [2]:
from sklearn.preprocessing import LabelEncoder

In [3]:
#create a sample data set with a categorical variable
df = pd.DataFrame({'color':['red','blue','green','red','blue']})

In [4]:
df

   color
0    red
1   blue
2  green
3    red
4   blue

In [5]:
encoder = LabelEncoder()

In [6]:
encoder.fit_transform(df[['color']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 2, 0])

# ordinal encoding

In [7]:
from sklearn.preprocessing import OrdinalEncoder

df = pd.DataFrame({'size':['small','mediam','large','mediam','small','large']})

In [8]:
df

     size
0   small
1  mediam
2   large
3  mediam
4   small
5   large

In [9]:
encoder = OrdinalEncoder(categories=[['small','mediam','large']])

In [10]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

##target guided ordinal encoding

In [13]:
df = pd.DataFrame({
'city':['new yourk','paris','london','tokiyo','new yourk','paris'],
'price':[200,300,150,100,220,230]
})

In [14]:
df

        city  price
0  new yourk    200
1      paris    300
2     london    150
3     tokiyo    100
4  new yourk    220
5      paris    230

In [19]:
# calculate the mean price in each city
mean_price=df.groupby('city')['price'].mean().to_dict()

In [20]:
df['city_encoded']=df['city'].map(mean_price)

In [21]:
df

        city  price  city_encoded
0  new yourk    200         210.0
1      paris    300         265.0
2     london    150         150.0
3     tokiyo    100         100.0
4  new yourk    220         210.0
5      paris    230         265.0

In [2]:
import seaborn as sns
df=sns.load_dataset('tips')

In [3]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4